#!/bin/bash

# Проверка, что пользователь ввел необходимые два аргумента
if [[ "$#" -ne 2 ]]
then
  echo "Ошибка:(! Введено неверное количество аргументов, нужно 2."
  echo "Необходимо указать режим: -u (для заглавных букв) и -l (для строчных),\
 далее ввести слово" 
  exit 1
fi
# Запись аргументов в переменные
mode="$1"
word="$2"
# Замена регистра
if [[ "$mode" == "-u" ]]; then
  echo "${word^^}"
elif [[ "$mode" == "-l" ]]; then
  echo "${word,,}"
else
  echo "Ошибка! Неверно введен режим, нужно использовать -u или -l"
  exit 1
fi
