#!/bin/bash

# Проверяет является ли поданное на вход файлом или директорией
# В случае файла выводит подробную информацию и количество строк
# В случае директории - список файлов
# Если файла нет - ошибку

file="$1"

# Проверяем существует ли путь
if [[ ! -e "$file" ]]; then
  echo "Ошибка файла $file не существует!"
  exit 1
fi

# Проверяем директория ли
if [[ -d "$file" ]]; then
  echo "Это директория, список файлов:"
  ls "$file"
else
  echo "Это файл, информация о нем:"
  stat "$file"
  echo "Число строк в файле:"
  wc -l "$file"
fi
