#!/bin/bash

# Скрипт меняет расширение файла. Поддерживаются форматы: txt, pdf, doc

# Заводим переменные, которые подает пользователь на ввод
file_path="$1"
init_exp="$2"
new_exp="$3"

# Проверяем соответствует изначальное расширение файла условию
case "$init_exp" in
  txt|pdf|doc) ;;
  *)
  echo "Ошибка! Формат $init_exp не поддерживается."
  echo "Поддерживаемые форматы: txt, pdf, doc"
  exit 1
  ;;
esac

# Проверяем соответствует ли новое расширение условию
case "$new_exp" in
  txt|pdf|doc) ;;
  *)
  echo "Ошибка! Формат $new_exp не поддерживается."
  echo "Поддерживаемые форматы: txt, pdf, doc"
  exit 1
  ;;
esac

# Меняем изначальное расширение на новое
new_form="${file_path%.*}.$new_exp"
mv -- "$file_path" "$new_form"
echo "Расширение успешно изменено: $new_form"
